In [30]:
import numpy
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline

In [12]:
df = pd.read_csv('data/data.CSV',encoding='euc-kr')

# .head()를 통해 데이터셋의 구조를 확인

In [27]:
df.head()

     월 요일    사고건수  사망자수    중상자수    경상자수  부상신고자수  Unnamed: 7
0  01월  일  2232.0  67.0  1080.0  2625.0   159.0         NaN
1  01월  월  2535.0  55.0  1207.0  2627.0   142.0         NaN
2  01월  화  2617.0  67.0  1253.0  2664.0   135.0         NaN
3  01월  수  2231.0  62.0  1019.0  2274.0   114.0         NaN
4  01월  목  2453.0  66.0  1078.0  2338.0   135.0         NaN

In [28]:
df.tail()

      월   요일    사고건수  사망자수    중상자수    경상자수  부상신고자수  Unnamed: 7
80  12월    수  2367.0  57.0   981.0  2428.0   163.0         NaN
81  12월    목  2302.0  51.0  1020.0  2361.0   167.0         NaN
82  12월    금  2735.0  69.0  1306.0  2912.0   179.0         NaN
83  12월    토  2942.0  65.0  1292.0  3367.0   211.0         NaN
84  NaN  NaN     NaN   NaN     NaN     NaN     NaN         NaN

In [70]:
df_mon = df[df.요일 == '월']
df_tus = df[df.요일 == '화']
df_wen = df[df.요일 == '수']
df_tur = df[df.요일 == '목']
df_fri = df[df.요일 == '금']
df_sat = df[df.요일 == '토']
df_sun = df[df.요일 == '일']
df_mon

      월 요일    사고건수  사망자수    중상자수    경상자수  부상신고자수  Unnamed: 7
1   01월  월  2535.0  55.0  1207.0  2627.0   142.0         NaN
8   02월  월  2323.0  71.0  1051.0  2241.0   133.0         NaN
15  03월  월  2339.0  55.0  1086.0  2211.0   155.0         NaN
22  04월  월  3181.0  93.0  1431.0  3008.0   191.0         NaN
29  05월  월  2553.0  54.0  1219.0  2515.0   175.0         NaN
36  06월  월  2428.0  69.0  1116.0  2191.0   167.0         NaN
43  07월  월  2970.0  61.0  1355.0  2779.0   199.0         NaN
50  08월  월  2420.0  52.0  1001.0  2473.0   182.0         NaN
57  09월  월  2509.0  60.0  1076.0  2509.0   158.0         NaN
64  10월  월  3043.0  77.0  1347.0  3007.0   217.0         NaN
71  11월  월  2610.0  68.0  1259.0  2504.0   189.0         NaN
78  12월  월  2777.0  64.0  1217.0  2865.0   167.0         NaN

In [74]:
mon_total = df_mon["사고건수"].sum()
tus_total = df_tus["사고건수"].sum()
wen_total = df_wen["사고건수"].sum()
tur_total = df_tur["사고건수"].sum()
fri_total = df_fri["사고건수"].sum()
sat_total = df_sat["사고건수"].sum()
sun_total = df_sun["사고건수"].sum()

In [83]:
s1 = pd.core.series.Series(['월', '화', '수','목', '금', '토', '일'])
s2 = pd.core.series.Series([mon_total, tus_total, wen_total, tur_total, fri_total, sat_total, sun_total])